app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT `students`.* FROM `students`

  def show
    @student = Student.find(params[:id])
---
SELECT `students`.* FROM `students` WHERE (`students`.`id` = 1) LIMIT 1

  def edit
    @student = Student.find(params[:id])
---
SELECT `students`.* FROM `students` WHERE (`students`.`id` = 1) LIMIT 1

  def create
    @student = Student.new(params[:student])
    @student.first_name = params[:student][:first_name].titleize
     @student.last_name = params[:student][:last_name].titleize

    respond_to do |format|
      if @student.save
---
INSERT INTO `students` (`am_paid`, `first_name`, `mobile`, `updated_at`, `email`, `check`, `last_name`, `created_at`, `address`, `out_of`) VALUES (12121, 'Nitin', '1234567890', '2012-01-19 12:36:25', 'nitin@railsfactory.orgiu', 1, 'Oumar', '2012-01-19 12:35:00', 'dghgd', 21212)

  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])
---
SELECT `students`.* FROM `students` WHERE (`students`.`id` = 4) LIMIT 1
UPDATE `students` SET `updated_at` = '2012-01-19 11:41:12', `check` = 1 WHERE (`students`.`id` = 5)

  def destroy
    @student = Student.find(params[:id])
    @student.destroy
---
SELECT `students`.* FROM `students` WHERE (`students`.`id` = 1) LIMIT 1
DELETE FROM `students` WHERE (`students`.`id` = 1)